Repository: Sma1lboy/rove
Catalog: packages/rove-ios/Sources/RoveMobile/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ ago
zh_hans: %@前

source: %@ finished working
zh_hans: %@ 已完成工作

source: %@ is waiting on you
zh_hans: %@ 等你处理

source: %@ keeps no transcript rove can read, so there is nothing to hand off
zh_hans: %@ 没有 rove 可读取的对话记录，无可交接

source: %@ routines
zh_hans: %@ 条例行任务

source: %@ tasks
zh_hans: %@ 个任务

source: %@ · %@ · next %@
zh_hans: %1$@ · %2$@ · 下次 %3$@

source: %@ → %@ · +0 −0, contents unchanged
zh_hans: %1$@ → %2$@ · +0 −0，内容未变

source: %@ → %@ · contents unchanged
zh_hans: %1$@ → %2$@ · 内容未变

source: %lld action
zh_hans: %lld 个 action

source: %lld actions
zh_hans: %lld 个 action

source: %lld attempts started
zh_hans: 已启动 %lld 次尝试

source: %lld engine
zh_hans: %lld 个引擎

source: %lld engines
zh_hans: %lld 个引擎

source: %lld event
zh_hans: %lld 个 event

source: %lld events
zh_hans: %lld 个 event

source: %lld file
zh_hans: %lld 个文件

source: %lld file · combined
zh_hans: %lld 个文件 · 合并

source: %lld files
zh_hans: %lld 个文件

source: %lld files · combined
zh_hans: %lld 个文件 · 合并

source: %lld messages
zh_hans: %lld 条消息

source: %lld need you
zh_hans: %lld 张等你处理

source: %lld of %lld messages
zh_hans: %1$lld/%2$lld 条消息

source: %lld of %lld on
zh_hans: %1$lld/%2$lld 已开

source: %lld on
zh_hans: %lld 已开

source: %lld pane
zh_hans: %lld 个面板

source: %lld panes
zh_hans: %lld 个面板

source: %lld unreadable record skipped, the board may be incomplete
zh_hans: 已跳过 %lld 条无法读取的记录，看板可能不完整

source: %lld unreadable records skipped, the board may be incomplete
zh_hans: 已跳过 %lld 条无法读取的记录，看板可能不完整

source: %lld unreadable, skipped: %@
zh_hans: %lld 个无法读取，已跳过：%@

source: %lld unsent · %lld total
zh_hans: %1$lld 条未发送 · 共 %2$lld 条

source: %lldd
zh_hans: %lld 天

source: %lldh
zh_hans: %lld 小时

source: %lldm
zh_hans: %lld 分钟

source: %lldmo
zh_hans: %lld 个月

source: (empty result)
zh_hans: （空结果）

source: + %lld more lines
zh_hans: + 另有 %lld 行

source: + files a story
zh_hans: 点 + 新建 story

source: + header
zh_hans: + 请求头

source: + options
zh_hans: + 选项

source: + schedules a prompt on a cron
zh_hans: 点 + 按 cron 调度一条提示词

source: + tab
zh_hans: + 标签页

source: +%lld more
zh_hans: 还有 %lld 条

source: A label only: the worktree, branch and session stay as they are. Canceled stops nothing; delete the task to end it.
zh_hans: 只是一个标签：worktree、分支和会话保持不变。canceled 不会停止任何东西；要结束任务请删除它。

source: A worktree with uncommitted changes is refused until you confirm again.
zh_hans: 有未提交改动的 worktree 会被拒绝，需再次确认。

source: Also discard uncommitted changes
zh_hans: 同时丢弃未提交的改动

source: Ask the engine for a PR…
zh_hans: 让引擎创建 PR…

source: Ask the engine to open a PR?
zh_hans: 让引擎创建 PR？

source: Attach
zh_hans: 添加附件

source: Attaching…
zh_hans: 连接中…

source: Attention, %lld unread
zh_hans: 待处理，%lld 条未读

source: Back
zh_hans: 返回

source: Both take effect on the next session rebuild.
zh_hans: 两项都在下次会话重建时生效。

source: Branch…
zh_hans: 分支…

source: Change engine…
zh_hans: 更换引擎…

source: Changes the title only. The git branch keeps its name.
zh_hans: 只修改标题，git 分支名保持不变。

source: Clear search
zh_hans: 清除搜索

source: Clears the name and launch-command overrides for %@. It goes back to its built-in settings; on or off stays as it is.
zh_hans: 清除 %@ 的名称和启动命令覆盖项，恢复为内置设置；开关状态保持不变。

source: Clears the name override: %@ goes back to its built-in name. The launch command stays.
zh_hans: 清除名称覆盖：%@ 恢复为内置名称。启动命令保留。

source: Clears this phone's screen and scrollback, then asks the app to redraw. The engine keeps running.
zh_hans: 清除本机的屏幕和滚动历史，然后让应用重绘。引擎继续运行。

source: Close %@
zh_hans: 关闭 %@

source: Close tab
zh_hans: 关闭标签页

source: Close this tab?
zh_hans: 关闭这个标签页？

source: Connected
zh_hans: 已连接

source: Connecting…
zh_hans: 连接中…

source: Connection lost
zh_hans: 连接已断开

source: Continue hands the new session this conversation's transcript. A native fork needs the desktop, so even the same engine gets a handoff here.
zh_hans: 继续会把当前对话的记录交给新会话。原生派生需要桌面端，所以即使是同一引擎，这里也只做交接。

source: Continue in a new tab…
zh_hans: 在新标签页中继续…

source: Copy branch
zh_hans: 复制分支

source: Copy path
zh_hans: 复制路径

source: Create worktree
zh_hans: 创建 worktree

source: Delete task
zh_hans: 删除任务

source: Delete this task?
zh_hans: 删除这个任务？

source: Deletes %@. The branch stays.
zh_hans: 将删除 %@。分支会保留。

source: Deletes the routine and its run history. Tasks it already created stay.
zh_hans: 将删除该例行任务及其执行记录。它已经创建的任务不受影响。

source: Delete…
zh_hans: 删除…

source: Direct
zh_hans: 直连

source: Disconnected
zh_hans: 已断开

source: Dismiss without opening
zh_hans: 不打开并忽略

source: Done
zh_hans: 完成

source: Drop note
zh_hans: 丢弃备注

source: Drop this note?
zh_hans: 丢弃这条备注？

source: Engine history
zh_hans: 引擎历史

source: Enter the Cloudflare Access client id and secret.
zh_hans: 请输入 Cloudflare Access 的 client id 和 secret。

source: Field notes
zh_hans: 现场笔记

source: File (image or pdf)
zh_hans: 文件（图片或 pdf）

source: Filter by project
zh_hans: 按项目筛选

source: Find in scrollback
zh_hans: 在滚动历史中查找

source: Force remove — discard changes
zh_hans: 强制删除——丢弃改动

source: Forcing takes a salvage snapshot of the uncommitted changes first (refs/rove/salvage), then removes the worktree.
zh_hans: 强制执行会先为未提交的改动保存一份抢救快照（refs/rove/salvage），再移除 worktree。

source: Forget project
zh_hans: 忘记项目

source: Forget this project?
zh_hans: 忘记这个项目？

source: Forget…
zh_hans: 忘记…

source: Fork a child task…
zh_hans: 派生子任务…

source: Fresh sessions on this repo stop receiving it. This cannot be undone.
zh_hans: 此仓库的新会话将不再收到它。此操作无法撤销。

source: Info
zh_hans: 信息

source: Interrupt turn
zh_hans: 中断本轮

source: Keeps the task and its branch.
zh_hans: 保留任务及其分支。

source: Land this branch
zh_hans: 合入此分支

source: Land this task
zh_hans: 合入此任务

source: Landed
zh_hans: 已合入

source: Landed on %@ (%@)
zh_hans: 已合入 %@（%@）

source: Lands %@ into the main branch, then removes its worktree.
zh_hans: 把 %@ 合入主分支，然后移除其 worktree。

source: Live
zh_hans: 实时

source: Makes %@ the engine new tasks start with.
zh_hans: 将 %@ 设为新任务默认启动的引擎。

source: Makes %@ the engine new tasks start with. It is switched off, so this switches it back on.
zh_hans: 将 %@ 设为新任务默认启动的引擎。它当前已关闭，此操作会同时将其开启。

source: Malformed response
zh_hans: 响应格式错误

source: Mention in engine
zh_hans: 在引擎中提及

source: Merge
zh_hans: 合并

source: Model & effort…
zh_hans: 模型与强度…

source: More
zh_hans: 更多

source: Move down
zh_hans: 下移

source: Move project down
zh_hans: 项目下移

source: Move project to top
zh_hans: 项目移到顶部

source: Move project up
zh_hans: 项目上移

source: Move to top
zh_hans: 移到顶部

source: Move up
zh_hans: 上移

source: New engine tab
zh_hans: 新建引擎标签页

source: New line
zh_hans: 换行

source: New routine
zh_hans: 新建例行任务

source: New session…
zh_hans: 新建会话…

source: New story
zh_hans: 新建 story

source: New task
zh_hans: 新建任务

source: Next waiting item
zh_hans: 下一个待处理项

source: No pull request for this task yet.
zh_hans: 此任务还没有拉取请求。

source: Not connected to the bridge
zh_hans: 未连接到 bridge

source: OK
zh_hans: 好

source: PR closed
zh_hans: PR 已关闭

source: PR merged
zh_hans: PR 已合并

source: PR open
zh_hans: PR 打开中

source: Page down
zh_hans: 下一页

source: Page up
zh_hans: 上一页

source: Pages
zh_hans: 页面

source: Pairing URLs must start with ws://, wss:// or rove://pair.
zh_hans: 配对 URL 必须以 ws://、wss:// 或 rove://pair 开头。

source: Paste a pairing URL first.
zh_hans: 请先粘贴配对 URL。

source: Photo
zh_hans: 照片

source: Pin to top
zh_hans: 置顶

source: Pinned
zh_hans: 已置顶

source: Posts a public GitHub Discussion in the rove repo, from your mac's gh login. It can't be unsent.
zh_hans: 以 Mac 上的 gh 登录身份，在 rove 仓库发布一条公开的 GitHub Discussion。发布后无法撤回。

source: Process exited
zh_hans: 进程已退出

source: Project
zh_hans: 项目

source: Project actions
zh_hans: 项目操作

source: Reconnecting (try %lld)…
zh_hans: 重连中（第 %lld 次）…

source: Refresh
zh_hans: 刷新

source: Refresh issues
zh_hans: 刷新议题

source: Rejected by the bridge or Cloudflare Access (401). Check the token and the Access service token.
zh_hans: 被 bridge 或 Cloudflare Access 拒绝（401）。请检查 token 和 Access service token。

source: Remove despite uncommitted work?
zh_hans: 仍要删除未提交的改动？

source: Remove entry
zh_hans: 移除条目

source: Remove header
zh_hans: 移除请求头

source: Remove project
zh_hans: 移除项目

source: Remove this entry?
zh_hans: 移除这个条目？

source: Remove this project?
zh_hans: 移除这个项目？

source: Remove this worktree?
zh_hans: 删除此 worktree？

source: Remove worktree
zh_hans: 删除 worktree

source: Removes only the story record. A linked task, its branch and its worktree are left alone.
zh_hans: 只移除 story 记录。已关联的任务、分支和 worktree 不受影响。

source: Removes the custom engine %@: its launch command, name and protocol are deleted from the mac.
zh_hans: 移除自定义引擎 %@：其启动命令、名称和协议将从 Mac 上删除。

source: Removes the entry from Rove only. Your directory and everything in it stays where it is.
zh_hans: 只从 Rove 中移除该条目。你的目录及其中所有内容原样保留。

source: Removes the entry only — your directory stays.
zh_hans: 只移除条目 —— 你的目录不受影响。

source: Removes the task and its worktree.
zh_hans: 移除任务及其 worktree。

source: Removes the task and its worktree. The git branch stays, so committed work is not lost.
zh_hans: 移除任务及其 worktree。git 分支保留，已提交的工作不会丢失。

source: Removes the worktree directory only. The task and its git branch stay, and creating the worktree again brings the files back.
zh_hans: 只移除 worktree 目录。任务及其 git 分支保留，重新创建 worktree 即可恢复文件。

source: Remove…
zh_hans: 移除…

source: Rename
zh_hans: 重命名

source: Rename tab
zh_hans: 重命名标签页

source: Renames %@ to “%@” on the mac and in this app. The launch command stays.
zh_hans: 在 Mac 和本应用中将 %1$@ 重命名为“%2$@”。启动命令保留。

source: Request timed out
zh_hans: 请求超时

source: Reset terminal
zh_hans: 重置终端

source: Reset terminal…
zh_hans: 重置终端…

source: Reset this terminal?
zh_hans: 重置此终端？

source: Rove stops listing it. The repo and its tasks stay on disk.
zh_hans: Rove 不再列出它。仓库及其任务仍保留在磁盘上。

source: Rove stops tracking this project. The repo and its tasks stay on disk, and adding the folder again brings it back.
zh_hans: Rove 不再跟踪这个项目。仓库及其任务仍保留在磁盘上，再次添加该文件夹即可恢复。

source: Run again
zh_hans: 再次运行

source: Run again (%@)
zh_hans: 再次运行（%@）

source: Search
zh_hans: 搜索

source: Send %lld
zh_hans: 发送 %lld 条

source: Send PR request
zh_hans: 发送 PR 请求

source: Send unsent notes?
zh_hans: 发送未发送的备注？

source: Sends this repo's PR instructions to the tab. The engine commits, pushes to origin and opens the PR.
zh_hans: 把此仓库的 PR 说明发给该标签页。引擎会提交、推送到 origin 并创建 PR。

source: Set status…
zh_hans: 设置状态…

source: Settings
zh_hans: 设置

source: Shell tabs and plugin panes need a desktop terminal, so the phone starts engines only.
zh_hans: Shell 标签页和插件面板需要桌面终端，手机端只能启动引擎。

source: Shown in the tab strip here and on the desktop.
zh_hans: 显示在此处和桌面端的标签栏。

source: Sort
zh_hans: 排序

source: Sort: %@
zh_hans: 排序：%@

source: Squash
zh_hans: Squash 合并

source: Start rove-bridge on your Mac, then scan the QR code it shows or paste the link it prints.
zh_hans: 在 Mac 上启动 rove-bridge，然后扫描它显示的二维码，或粘贴它打印的链接。

source: Stories start in the backlog. Start a session from one when it is time.
zh_hans: Story 从待办开始。时机到了再从中启动会话。

source: Switches %@ off: its actions and events stop running on the mac. It stays installed.
zh_hans: 关闭 %@：其 actions 和 events 在 Mac 上停止运行。仍保持已安装。

source: Switches %@ off: the TUI stops offering it and new tasks stop defaulting to it. Its settings stay.
zh_hans: 关闭 %@：TUI 不再提供它，新任务不再默认使用它。其设置保留。

source: Switches %@ off: the TUI stops offering it and new tasks stop defaulting to it. Its settings stay. It is the default, so another enabled engine takes over as default.
zh_hans: 关闭 %@：TUI 不再提供它，新任务不再默认使用它。其设置保留。它当前是默认引擎，将由另一个已开启的引擎接任默认。

source: Switches %@ on: its actions and events run again on the mac.
zh_hans: 开启 %@：其 actions 和 events 在 Mac 上恢复运行。

source: Switches %@ on: the TUI offers it again and new tasks can default to it.
zh_hans: 开启 %@：TUI 重新提供它，新任务可默认使用它。

source: Tabs share the worktree but keep their own process, scrollback and conversation.
zh_hans: 标签页共用 worktree，但各自保留进程、回滚内容和对话。

source: Takes effect the next time the session is rebuilt. A tab that is running keeps its current engine until then.
zh_hans: 下次重建会话时生效。在此之前，正在运行的标签页仍使用当前引擎。

source: Terminal mode
zh_hans: 终端模式

source: Terminal tools
zh_hans: 终端工具

source: That doesn't look like a valid pairing URL.
zh_hans: 这不是有效的配对 URL。

source: The Cloudflare preset needs a wss:// URL.
zh_hans: Cloudflare 预设需要 wss:// URL。

source: The child branches from %@: committed work carries over, uncommitted changes stay behind.
zh_hans: 子任务从 %@ 分出：已提交的工作会带过去，未提交的改动留在原处。

source: The issue body becomes the first prompt, marked as an untrusted report. Nothing is written back to GitHub.
zh_hans: 议题正文会作为首条提示词，并标记为不可信的报告。不会向 GitHub 写回任何内容。

source: The newest notes are handed to every fresh session on this repo, so retire any that stopped being true.
zh_hans: 最新的笔记会交给此仓库的每个新会话，请删除已失效的笔记。

source: The pairing URL has an unknown preset.
zh_hans: 配对 URL 中的预设未知。

source: The pairing URL has no token.
zh_hans: 配对 URL 中没有 token。

source: They go to the task's engine as one message.
zh_hans: 它们会合并为一条消息发给该任务的引擎。

source: This engine lists no models. Type one exactly as the engine expects it.
zh_hans: 此引擎没有列出模型。请按引擎要求的写法输入。

source: Top of scrollback
zh_hans: 滚动历史顶部

source: Type a new name, or tap a local branch. Renames with git branch -m once the worktree exists.
zh_hans: 输入新名称，或点选本地分支。worktree 存在后会用 git branch -m 重命名。

source: Unpin
zh_hans: 取消置顶

source: Unsaved edits to the story are saved first.
zh_hans: story 中未保存的改动会先保存。

source: What the worker says it delivered. Rove has not verified it.
zh_hans: worker 声称交付的内容，Rove 未验证。

source: Without this, a worktree with uncommitted changes is refused.
zh_hans: 不勾选的话，有未提交改动的 worktree 会被拒绝。

source: [ %@ ] not signed in
zh_hans: [ %@ ] 未登录

source: a new tab on the project checkout, no worktree
zh_hans: 在项目主目录新开标签页，不建 worktree

source: about
zh_hans: 关于

source: account
zh_hans: 账号

source: actions
zh_hans: 操作

source: activity
zh_hans: 活动

source: add a project on the mac first
zh_hans: 请先在 Mac 上添加项目

source: add a repo on the mac to see its activity
zh_hans: 在 Mac 上添加仓库即可查看其动态

source: adopt
zh_hans: 接管

source: adopt %lld
zh_hans: 接管 %lld 项

source: adopting %@
zh_hans: 接管中 %@

source: after
zh_hans: 启动后

source: agents: at most %lld in total
zh_hans: agents：总数最多 %lld 个

source: all
zh_hans: 全部

source: all %lld file as one diff
zh_hans: 全部 %lld 个文件合为一个 diff

source: all %lld files as one diff
zh_hans: 全部 %lld 个文件合为一个 diff

source: all projects
zh_hans: 全部项目

source: allow
zh_hans: 允许

source: an app owns the screen — only what it shows now is searchable; its history is its own
zh_hans: 屏幕由应用接管——只能搜索它当前显示的内容，历史由应用自己管理

source: app
zh_hans: 应用

source: asking the remotes
zh_hans: 正在询问远端…

source: assigned to me
zh_hans: 分配给我的

source: attempts
zh_hans: 尝试次数

source: attention
zh_hans: 待处理

source: back on the board while it works
zh_hans: 运行期间回到看板

source: backlog
zh_hans: 待办

source: backlog is empty
zh_hans: 待办为空

source: banners
zh_hans: 横幅

source: banners when a task needs you or finishes. only on this phone.
zh_hans: 任务等你处理或完成时弹出横幅。仅作用于这台手机。

source: base
zh_hans: 基础分支

source: base %@
zh_hans: 基于 %@

source: binary
zh_hans: 可执行文件

source: binary file
zh_hans: 二进制文件

source: binary file changed
zh_hans: 二进制文件已改动

source: blank clears the override and brings back the built-in name
zh_hans: 留空即清除覆盖并恢复内置名称

source: blocked agents and finished turns land here
zh_hans: 被阻塞的 agent 和已完成的回合会出现在这里

source: board
zh_hans: 看板

source: branch
zh_hans: 分支

source: branch name
zh_hans: 分支名

source: branch off
zh_hans: 从此分支切出

source: branch vs %@
zh_hans: 分支对比 %@

source: built-in
zh_hans: 内置

source: cache
zh_hans: 缓存

source: cancel
zh_hans: 取消

source: change engine
zh_hans: 更换引擎

source: changed
zh_hans: 已改动

source: changes
zh_hans: 改动

source: checked out
zh_hans: 已检出

source: checks
zh_hans: 检查

source: clean
zh_hans: 干净

source: clear
zh_hans: 清除

source: clear name override
zh_hans: 清除名称覆盖

source: clone
zh_hans: 克隆

source: cloned to %@
zh_hans: 已克隆到 %@

source: cloning…
zh_hans: 克隆中…

source: close
zh_hans: 关闭

source: code %lld
zh_hans: 退出码 %lld

source: collapsed
zh_hans: 已折叠

source: combined diff
zh_hans: 合并 diff

source: commits on this branch since it left %@; uncommitted edits are under the other tab
zh_hans: 此分支自 %@ 分出以来的提交；未提交的改动在另一个标签页

source: committed
zh_hans: 已提交

source: connect
zh_hans: 连接

source: connect a mac
zh_hans: 连接 mac

source: connected
zh_hans: 已连接

source: connecting
zh_hans: 连接中

source: connection
zh_hans: 连接

source: continue this one
zh_hans: 延续当前对话

source: conversation
zh_hans: 对话

source: copied
zh_hans: 已复制

source: copied branch · %@
zh_hans: 已复制分支 · %@

source: copied path · %@
zh_hans: 已复制路径 · %@

source: copy
zh_hans: 复制

source: could not link #%lld to its task
zh_hans: 无法把 #%lld 关联到它的任务

source: could not mark #%lld doing
zh_hans: 无法把 #%lld 标记为进行中

source: count
zh_hans: 数量

source: count or agents, not both. fan-out needs a first prompt.
zh_hans: 数量与 agents 二选一。批量创建需要首条提示词。

source: create %lld tasks
zh_hans: 创建 %lld 个任务

source: create routine
zh_hans: 创建例行任务

source: create task
zh_hans: 创建任务

source: cron + prompt
zh_hans: cron + 提示词

source: current
zh_hans: 当前

source: custom
zh_hans: 自定义

source: daemon out of date
zh_hans: daemon 版本过旧

source: daily 9:00
zh_hans: 每天 9:00

source: declares nothing
zh_hans: 未声明任何内容

source: declares: %@
zh_hans: 声明：%@

source: decrease
zh_hans: 减少

source: default
zh_hans: 默认

source: default engine
zh_hans: 默认引擎

source: delete
zh_hans: 删除

source: delete note
zh_hans: 删除笔记

source: delete routine
zh_hans: 删除例行任务

source: delete story
zh_hans: 删除 story

source: delete task
zh_hans: 删除任务

source: delete this note?
zh_hans: 删除这条笔记？

source: delete this routine?
zh_hans: 删除这条例行任务？

source: delete this story?
zh_hans: 删除这个 story？

source: delete this task?
zh_hans: 删除这个任务？

source: deleting
zh_hans: 删除中

source: demo · not connected to a mac
zh_hans: 演示 · 未连接 mac

source: derived from the url
zh_hans: 自动从地址推导

source: description
zh_hans: 描述

source: detached
zh_hans: 游离 HEAD

source: detected
zh_hans: 检测到

source: digest
zh_hans: 摘要

source: dirty
zh_hans: 有改动

source: dirty?
zh_hans: 改动未知

source: discard changes and delete
zh_hans: 丢弃改动并删除

source: discard changes and remove
zh_hans: 丢弃改动并移除

source: discard uncommitted changes?
zh_hans: 丢弃未提交的改动？

source: disconnect
zh_hans: 断开

source: dismiss
zh_hans: 忽略

source: dispatch failed
zh_hans: 派发失败

source: dispatched
zh_hans: 已派发

source: display name
zh_hans: 显示名称

source: done
zh_hans: 已完成

source: drive your mac's tasks from here
zh_hans: 在这里操控你 Mac 上的任务

source: drop
zh_hans: 丢弃

source: drop note
zh_hans: 丢弃备注

source: due
zh_hans: 即将

source: edit
zh_hans: 编辑

source: edit routine
zh_hans: 编辑例行任务

source: edits not committed yet in this task's worktree
zh_hans: 此任务 worktree 中尚未提交的改动

source: effort
zh_hans: 强度

source: empty
zh_hans: 空

source: empty file added
zh_hans: 空文件已新增

source: empty file deleted
zh_hans: 空文件已删除

source: enabled routines keep the mac daemon alive
zh_hans: 已启用的例行任务会让 Mac 上的守护进程保持常驻

source: engine
zh_hans: 引擎

source: engine default
zh_hans: 引擎默认

source: engine gone
zh_hans: 引擎已消失

source: engine history
zh_hans: 引擎历史

source: engines
zh_hans: 引擎

source: engines report quota once they have run
zh_hans: 引擎运行后才会上报配额

source: enter a git url
zh_hans: 请输入 git 地址

source: enter a parent directory
zh_hans: 请输入父目录

source: error
zh_hans: 出错

source: events
zh_hans: 事件

source: every worktree of this repo is already a task.
zh_hans: 此仓库的所有 worktree 都已是任务。

source: existing
zh_hans: 已有

source: existing worktrees
zh_hans: 已有 worktree

source: exited
zh_hans: 已退出

source: expanded
zh_hans: 已展开

source: extra headers
zh_hans: 额外请求头

source: failed
zh_hans: 失败

source: fan-out needs a first prompt
zh_hans: 批量创建需要首条提示词

source: feedback
zh_hans: 反馈

source: field note #%lld
zh_hans: 现场笔记 #%lld

source: field notes
zh_hans: 现场笔记

source: file story
zh_hans: 创建 story

source: files
zh_hans: 文件

source: find in scrollback
zh_hans: 在滚动历史中查找

source: finished, unread
zh_hans: 已完成，未读

source: first message
zh_hans: 首条消息

source: first prompt
zh_hans: 首条提示词

source: fit
zh_hans: 适配

source: five-field cron, in the mac's local time
zh_hans: 五段 cron，使用 Mac 的本地时间

source: folder name
zh_hans: 文件夹名

source: folder name cannot contain /
zh_hans: 文件夹名不能包含 /

source: folder name is not valid
zh_hans: 文件夹名无效

source: follow
zh_hans: 跟随

source: forget pairing
zh_hans: 清除配对

source: forget project
zh_hans: 忘记项目

source: forget this project?
zh_hans: 忘记这个项目？

source: fork child task
zh_hans: 派生子任务

source: fork task
zh_hans: 派生任务

source: fresh
zh_hans: 全新

source: git clone runs on the Mac. then the checkout opens in the new-task form.
zh_hans: git clone 在 Mac 上运行，完成后检出会在新建任务表单中打开。

source: git gave no reason
zh_hans: git 未给出原因

source: git url
zh_hans: git 地址

source: github issues
zh_hans: GitHub 议题

source: has uncommitted work
zh_hans: 有未提交的改动

source: hide output
zh_hans: 收起输出

source: hooks installed
zh_hans: hooks 已安装

source: hooks missing
zh_hans: hooks 缺失

source: hooks outdated
zh_hans: hooks 已过期

source: host
zh_hans: 主机

source: hourly
zh_hans: 每小时

source: idle
zh_hans: 空闲

source: image
zh_hans: 图片

source: in %@
zh_hans: %@后

source: in main
zh_hans: 已在 main

source: in progress
zh_hans: 进行中

source: inbox
zh_hans: 收件箱

source: increase
zh_hans: 增加

source: info
zh_hans: 信息

source: input
zh_hans: 输入

source: install the gh cli on the mac
zh_hans: 在 Mac 上安装 gh CLI

source: installing and configuring plugins runs their own commands, so it stays on the mac (rove plugin …)
zh_hans: 安装和配置插件会运行其自带命令，因此只能在 Mac 上进行（rove plugin …）

source: interrupt
zh_hans: 中断

source: interrupt sent
zh_hans: 已发送中断

source: ios has not asked about notifications yet
zh_hans: iOS 尚未询问通知权限

source: ios notifications are off for rove
zh_hans: iOS 已关闭 rove 的通知

source: it is no longer in the registry
zh_hans: 它已不在注册表中

source: it is posted publicly in the rove repo, using the github login on your mac
zh_hans: 将使用 Mac 上的 github 登录，公开发布到 rove 仓库

source: its base
zh_hans: 其基线

source: keep it, go back
zh_hans: 保留，返回

source: kind
zh_hans: 类型

source: land
zh_hans: 合入

source: land branch
zh_hans: 合入分支

source: landed on %@ (%@)
zh_hans: 已合入 %1$@（%2$@）

source: language follows ios settings → rove
zh_hans: 语言跟随 iOS 设置 → rove

source: last run %@ %@
zh_hans: 上次运行 %1$@ %2$@

source: last run %@ %@ %@ ago
zh_hans: 上次运行 %1$@ %2$@，%3$@前

source: last runs
zh_hans: 最近执行

source: latest
zh_hans: 最近

source: latest ↓
zh_hans: 最新 ↓

source: launch commands are edited on the mac — a command typed on a phone would run on the mac
zh_hans: 启动命令请在 Mac 上编辑——在手机上输入的命令会在 Mac 上执行

source: leave empty to open the worktree without starting the engine
zh_hans: 留空则只打开 worktree，不启动引擎

source: lifecycle
zh_hans: 生命周期

source: limited
zh_hans: 已截断

source: line %lld
zh_hans: 第 %lld 行

source: lines %lld–%lld
zh_hans: 第 %1$lld–%2$lld 行

source: linked
zh_hans: 已关联

source: linked task
zh_hans: 关联任务

source: list capped — search to reach the rest
zh_hans: 列表已截断——搜索以找到其余文件

source: live
zh_hans: 实时

source: load newer
zh_hans: 加载更新

source: loading
zh_hans: 加载中…

source: loading task
zh_hans: 加载任务中…

source: local branches
zh_hans: 本地分支

source: logged in
zh_hans: 已登录

source: login unknown
zh_hans: 登录状态未知

source: main checkout
zh_hans: 主检出

source: make default
zh_hans: 设为默认

source: markers
zh_hans: 完成标记

source: merge or squash into main
zh_hans: merge 或 squash 合入 main

source: mergeable
zh_hans: 可合并

source: message
zh_hans: 消息

source: mode changed
zh_hans: 权限模式已改动

source: model
zh_hans: 模型

source: model & effort
zh_hans: 模型与强度

source: model, in the engine's own spelling
zh_hans: 模型名，按引擎自己的写法

source: name
zh_hans: 名称

source: name is longer than %lld characters
zh_hans: 名称超过 %lld 个字符

source: name, prompt, schedule
zh_hans: 名称、提示词、调度

source: needs input
zh_hans: 等待输入

source: network
zh_hans: 网络

source: new routine
zh_hans: 新建例行任务

source: new session
zh_hans: 新建会话

source: new story
zh_hans: 新建 story

source: new tab here
zh_hans: 在此新建标签页
